rottenpotatoes/app/controllers/movies_controller.rb

  def same_director
     @movie = Movie.find(params[:id])
     if @movie.director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'